; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	infrared2 - mode
	image3 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Star4 - direction
	Star5 - direction
	Star10 - direction
	Star9 - direction
	Star2 - direction
	Star6 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star10)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument4 spectrograph4)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star4)
	(supports instrument5 image1)
	(supports instrument5 image3)
	(calibration_target instrument5 Star10)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph4)
	(supports instrument6 image3)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star9)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite2 GroundStation7)
	(have_image Phenomenon12 image3)
	(have_image Star13 image3)
	(have_image Star14 spectrograph4)
	(have_image Planet15 image3)
	(have_image Phenomenon16 spectrograph4)
))

)

; plan
1. (turn_to satellite2 star2 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star2)
   goals met: 0 of 6
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite2 phenomenon16 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 6
5. (take_image satellite2 phenomenon16 instrument6 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon12 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite2 phenomenon12 instrument6 image3)
   added: (have_image phenomenon12 image3)
   goals met: 2 of 6
8. (turn_to satellite2 planet15 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet15)
   goals met: 2 of 6
9. (take_image satellite2 planet15 instrument6 image3)
   added: (have_image planet15 image3)
   goals met: 3 of 6
10. (turn_to satellite2 star13 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star13)
   goals met: 3 of 6
11. (take_image satellite2 star13 instrument6 image3)
   added: (have_image star13 image3)
   goals met: 4 of 6
12. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 4 of 6
13. (take_image satellite2 star14 instrument6 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 5 of 6
14. (turn_to satellite2 groundstation7 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 groundstation7)
   goals met: 6 of 6
